package com.greenstone.mes.common.core.enums;

/**
 * 资产错误代码 6XXXX
 *
 * @author gu_renkai
 * @date 2022/11/8 9:41
 */

public enum AssetError implements ServiceError {
    //  资产分类
    E60101(60101, "选择的资产分类不存在"),
    E60102(60102, "缺少资产分类代码"),
    E60103(60103, "属性名称不能重复"),
    E60104(60104, "所属分类不存在"),
    E60105(60105, "资产分类编码已被使用"),
    E60106(60106, "不能将分类移动到末级分类下"),
    E60107(60107, "当前资产分类已被标准型号引用，不允许删除"),
    E60108(60108, "当前资产分类已被资产数据引用，不允许删除"),
    E60109(60109, "删除的资产分类不存在"),
    E60110(60110, "该分类下包含子分类，不允许删除"),
    E60111(60111, "父资产分类不能是自身"),

    // 资产规格型号
    E61001(61001, "选择的规格不存在"),

    // 资产
    E62001(62001, "请选择末级分类作为资产的所属分类"),
    E62002(62002, "选择的领用人不存在"),
    E62003(62003, "资产编码已被使用"),
    E62004(62004, "选择的资产不存在"),
    E62005(62005, "内部错误：生成资产编码失败"),

    // 领用单
    E63001(63001, "内部错误：生成领用单号失败"),
    E63002(63002, "选择的资产应处于闲置状态"),

    // 退库单
    E64001(64001, "内部错误：生成退库单号失败"),
    E64002(64002, "选择的资产应处于在用状态"),
    E64003(64003, "选择的归还人不存在"),

    // 维修单
    E65001(65001, "选择的维修单不存在"),
    E65002(65002, "内部错误：生成维修单号失败"),
    ;
    public final int code;

    public final String msg;

    AssetError(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMsg() {
        return msg;
    }
}
