package com.greenstone.mes.common.core.enums;

/**
 * 业务错误代码
 *
 * @author gu_renkai
 * @date 2022/11/8 9:41
 */

public enum BizError implements ServiceError {
    E17001(17001, "导入的数据为空"),

    E20001(20001, "物料不存在"),
    E20002(20002, "物料重复"),

    E21001(21001, "设计图不存在"),

    E23001(23001, "仓库不存在"),
    E23002(23002, "库存不足"),
    E23003(23003, "请先将存放点内的零件清空"),
    E23004(23004, "仓库不支持全部出库"),
    E23005(23005, "仓库编码重复"),
    E23006(23006, "出库清单不能为空"),
    E23007(23007, "必须选择入库仓库"),
    E23008(23008, "必须选择出库仓库"),
    E23009(23009, "选择的仓库无法进行此操作"),
    E23010(23010, "必须选择一个仓库进行操作"),
    E23011(23011, "仓库无法使用，该仓库已绑定项目"),

    E24001(24001, "BOM不存在"),

    E25001(25001, "加工单不存在"),
    E25002(25002, "加工单号格式错误"),
    E25003(25003, "加工单号不唯一"),
    E25004(25004, "项目代码不唯一"),
    E25005(25005, "加工单状态错误"),
    E25006(25006, "加工单内容错误"),
    E25007(25007, "购买原因错误"),
    E25008(25008, "零件号/版本错误"),
    E25009(25009, "加工单内该零件不存在"),
    E25010(25010, "加工单已确认,删除失败"),
    E25011(25011, "需求单处于不可修改状态"),

    E26001(26001, "任务单不存在"),

    E27001(27001, "领料单不存在"),

    E28001(28001, "投诉记录不存在"),

    E29001(29001, "供应商不存在"),

    E30001(30001, "必须填写完整的时间范围"),
    E30002(30002, "必须填写完整的时间范围或项目代码"),

    E40001(40001, "格式错误，正确时间格式为：年/月/日"),
    E40002(40002, "项目代码不存在"),

    E50001(50001, "查询时间范围不能超过一个月"),
    E50002(50002, "根部门缺失，请先在系统中创建根部门"),
    E50003(50003, "获取系统部门失败"),

    E60001(60001, "无法操作，该步骤没有相关零件库存"),
    E60002(60002, "零件已领用，无法操作"),
    E60003(60003, "未找到该零件上一次操作信息"),
    E60004(60004, "无法操作，该零件已流转到后续仓库"),
    E60005(60005, "零件转移中，请勿重复点击"),
    ;
    private final int code;

    private final String msg;

    BizError(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMsg() {
        return msg;
    }
}
