package com.greenstone.mes.common.core.enums;

/**
 * 物品错误代码 8XXXX
 *
 * @author gu_renkai
 * @date 2022/11/8 9:41
 */

public enum ItemError implements ServiceError {
    //  物品分类
    E80101(80101, "选择的物品分类不存在"),
    E80102(80102, "缺少物品分类代码"),
    E80103(80103, "属性名称不能重复"),
    E80104(80104, "所属分类不存在"),
    E80105(80105, "物品分类编码已被使用"),
    E80106(80106, "不能将分类移动到末级分类下"),
    E80107(80107, "当前物品分类已被标准型号引用，不允许删除"),
    E80108(80108, "当前物品分类已被物品数据引用，不允许删除"),
    E80109(80109, "删除的物品分类不存在"),
    E80110(80110, "该分类下包含子分类，不允许删除"),
    E80111(80111, "父物品分类不能是自身"),

    // 物品规格型号
    E81001(81001, "选择的规格不存在"),
    E81002(81002, "当前物品型号在仓库有库存，不允许删除"),

    // 物品
    E82001(82001, "请选择末级分类作为物品的所属分类"),
    E82002(82002, "选择的领用人不存在"),
    E82003(82003, "物品编码已被使用"),
    E82004(82004, "选择的物品不存在"),
    E82005(82005, "内部错误：生成物品编码失败"),

    // 领用单
    E83001(83001, "内部错误：生成领用单号失败"),
    E83002(83002, "选择的物品应处于闲置状态"),

    // 退库单
    E84001(84001, "内部错误：生成退库单号失败"),
    E84002(84002, "选择的物品应处于在用状态"),
    E84003(84003, "选择的归还人不存在"),
    ;
    public final int code;

    public final String msg;

    ItemError(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMsg() {
        return msg;
    }
}
