package com.greenstone.mes.common.core.enums;

/**
 * 机加工错误代码 20XXXX
 */

public enum MachineError implements ServiceError {
    E200101(200101, "选择的单据不存在"),
    E200102(200102, "不允许修改非草稿状态的单据"),
    E200103(200103, "只能够关闭完成状态的单据"),
    E200104(200104, "无法变更单据为草稿或提交以外的状态"),
    E200105(200105, "机加工申请单已确认，不能重复确认"),
    E200106(200106, "机加工申请单不存在"),
    E200107(200107, "机加工申请单中不存在该零件"),
    E200108(200108, "机加工订单中不存在该零件"),
    E200109(200109, "只能选择已审批的机加工申请单"),
    E200110(200110, "不能选择已关闭的机加工申请单"),
    E200111(200111, "只能提交草稿状态的单据"),
    E200112(200112, "只能撤回已提交状态的单据"),
    E200113(200113, "不允许此操作"),
    E200114(200114, "只能退回已审批状态的单据"),
    E200115(200115, "单据不在审批中状态"),
    E200116(200116, "只能提交草稿或驳回状态的单据"),
    E200117(200117, "只能撤回审批中状态的单据"),
    E200118(200118, "只能删除草稿或驳回状态的单据"),
    E200119(200119, "零件所在的订单还未生效，无法收货"),
    E200120(200120, "申请单未提交"),
    E200121(200121, "此申请单已审批，请勿重复扫码"),
    E200122(200122, "此零件信息未上传，需要设计上传"),

    E200002(200002, "机加工申请单号格式错误"),
    E200003(200003, "机加工申请单号不唯一"),
    E200004(200004, "项目代码不唯一"),
    E200005(200005, "物料未找到"),
    E200006(200006, "零件未找到"),
    E200007(200007, "仓库未找到"),
    E200008(200008, "零件还未登记收货"),
    E200009(200009, "请选择正确的仓库"),
    E200010(200010, "库存不足"),
    E200011(200011, "零件在该仓库中不存在"),
    E200012(200012, "砧板不可用"),
    E200013(200013, "系统禁用砧板，请选择仓库"),
    E200014(200014, "库存不足，请先调整库存"),
    E200015(200015, "一个调拨单对应一个区域"),


    E200201(200201, "撤回后数量应小于原数量"),
    E200202(200202, "申请单为草稿，可直接在申请单中编辑，无需提交撤回单"),
    E200203(200203, "可在申请单中自行撤回后直接编辑，无需提交撤回单"),
    E200204(200204, "撤回单中不存在该零件"),
    E200205(200205, "申请单已锁定，请联系相关人员解锁后，在申请单中直接编辑，无需提交撤回单"),
    E200206(200206, "只能撤回已审批状态的申请单"),

    E200301(200301, "零件不在同一质检单中"),
    E200302(200302, "操作不正确"),
    E200303(200303, "NG原因不为空"),
    E200304(200304, "零件不在该质检单中"),
    E200305(200305, "待检零件不足"),
    E200306(200306, "零件未设定表处要求"),
    E200307(200307, "请联系管理员添加系统字典：表面处理"),
    E200308(200308, "零件未设定表处顺序，不可表处"),
    E200309(200309, "请按照表处顺序依次表处"),
    E200310(200310, "质检单中，未找到对应零件"),
    E200311(200311, "检验结果类型未找到"),

    E200401(200401, "合格品入库，合格品库存为空"),

    E200501(200501, "只能领取已提交的领料单"),
    E200502(200502, "已领取，不能多次领取"),


    ;
    public final int code;

    public final String msg;

    MachineError(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMsg() {
        return msg;
    }
}
